scripts/paper3/openfoam/pureBlockMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     alkaWEFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         15;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep 	yes;
maxCo 		0.4;
maxDeltaT	0.1;

libs ("libpidUNeConstraint.so");

functions
{

	planeAvg
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;

        // --- what to compute
        operation       areaAverage;
        fields          (Ie Ue);          // U = vector avg; Umag = scalar avg

        // --- define the plane (sampled surface)
        regionType      sampledSurface;
        name            midPlane;          // label for the plane in outputs

        sampledSurfaceDict
        {
            type                plane;
            planeType           pointAndNormal;   // other option: pointAndTwoDirs
            pointAndNormalDict
            {
                point   (0 0 0.11e-3);
                normal (0 0 1);
            }
            // expand big bounds to ensure full cut through the domain
            triangulate         false;
            interpolate         true;
        }

        // --- when/how to write
        writeControl   runTime;           // or 'time' / 'runTime'
        writeInterval  0.1;                  // every step; change as you like
        surfaceFormat  none;               // no full surface dump, just the stats
        writeFields    false;              // don’t write sampled fields on the plane
        writeToFile    true;               // writes values to postProcessing/planeAvg/...
    }
    
    midPlaneZone
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;

        // --- what to compute
        operation       areaAverage;
        fields          (Ie Ue);          // U = vector avg; Umag = scalar avg

        // --- define the plane (sampled surface)
        regionType      faceZone;
        name            midPlaneZone;          // label for the plane in outputs

        

        // --- when/how to write
        writeControl   runTime;           // or 'time' / 'runTime'
        writeInterval  0.1;                  // every step; change as you like
        surfaceFormat  none;               // no full surface dump, just the stats
        writeFields    false;              // don’t write sampled fields on the plane
        writeToFile    true;               // writes values to postProcessing/planeAvg/...
    }
    
    
    outlet_cathode
	{
	name    outlet_cathode;
	fields  (alpha.gas);

	operation areaAverage;

	type            surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");

	writeControl    runTime;
	writeInterval   0.01;

	writeFields     false;
	log             false;

	regionType  patch;
	}
	
	outlet_anode
	{
	name    outlet_anode;
	fields  (alpha.gas);

	operation areaAverage;

	type            surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");

	writeControl    runTime;
	writeInterval   0.1;

	writeFields     false;
	log             false;

	regionType  patch;
	}
	
surface1
{
    type            surfaces;
        libs            (sampling);
        enabled         true;
	    writeControl    runTime;
	    writeInterval   0.1;

        interpolationScheme cellPoint;
        surfaceFormat       vtk;

        fields          (alpha.gas U UNe UPe Ne Pe J Ie C_OH.electrolyte C_H2O.electrolyte C_H2.electrolyte C_O2.electrolyte);

        surfaces
        {
        
        plane1
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (0 0 1);
        }
        plane2
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 2.225e-3);
            normal  (0 0 1);
        }
        plane3
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 3.725e-3);
            normal  (0 0 1);
        }

        plane02
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 -2.225e-3);
            normal  (0 0 1);
        }
        plane03
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 -3.725e-3);
            normal  (0 0 1);
        }
        planeY
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (0 1 0);
        }
        planeXY
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (1 1 0);
        }
        planeX
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (1 0 0);
        }
        planemXY
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (-1 1 0);
        }
         planeXmY
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (1 -1 0);
        }
        planemXmY
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (-1 -1 0);
        }
        planem02XmY
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (-0.2 -1 0);
        }
        plane02XmY
        {

            type    plane;
            source  cells;
            store   false;

            point   (0 0 0);
            normal  (0.2 -1 0);
        }
            
        }	
}  
outletGasVolFlow_anode
{
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");

    regionType      patch;
    name            outlet_anode;

    fields          (alpha.gas);
    weightField     phi;

    operation       weightedAverage;

    writeControl    runTime;
    writeInterval   0.1;

    writeFields     false;
    log             true;
}
outletGasVolFlow_cathode
{
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");

    regionType      patch;
    name            outlet_cathode;

    fields          (alpha.gas);
    weightField     phi;

    operation       weightedAverage;

    writeControl    runTime;
    writeInterval   0.1;

    writeFields     false;
    log             true;
}  
}
// ************************************************************************* //
