scripts/paper3/openfoam/pureBlockMesh/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
generalSource2
{
    type            scalarFixedValueConstraint;
    
    selectionMode   cellZone;
    cellZone         anodeSource;
    fieldValues
    {
        UPe           0;
    }

    
}

energySource
{
    type   pidUNeConstraint;
    active yes;
    fields (UNe);

    pidUNeConstraintCoeffs
    {
        selectionMode cellZone;
        cellZone cathodeSource;

        initFromField  true;
        updateEveryNTimeSteps  2;
        

        faceZoneName midPlaneZone;
        currentField Ie;

        controlMode   total;      // total | average
        useProjected  true;         // compare to plane-normal flux
        normal        (0 0 1);

        jGoal     3000;
        Kp        0.1e-2;
        Ki        0;
        dUmax     0.1;
        Umin      -10;
        Umax      -1.35;
        initialU  -1.35;
        Nupdate   8;
        verbose   true;
    }
}







// ************************************************************************* //
