scripts/paper3/openfoam/pureBlockMesh/0.Orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{

    inlet_cathode
    {
        //type            fixedValue;
        //value		uniform (0.02318 0.00621 0);
        type            flowRateInletVelocity;
        volumetricFlowRate  constant 3e-6;

    }
    inlet_anode
    {
        //type            fixedValue;
        //value		uniform (0.02318 -0.00621 0);
        type            flowRateInletVelocity;
        volumetricFlowRate  constant 3e-6;

    }
    "outlet_(.*)"
    {
        type            pressureInletOutletVelocity;    // lets pressure set normal U
        value           uniform (0 0 0);
    }


    "wall(.*)"
    {
            type            noSlip;
    	//type	zeroGradient;
        //type            fixedValue;
        //value		$internalField;
        //type	flowRateInletVelocity;
        //volumetricFlowRate constant 1e-4;
    }
    
}


// ************************************************************************* //
