scripts/paper3/openfoam/pureBlockMesh/0.Orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "inlet_(.*)"
    {

       type            fixedFluxPressure;

    }

    "outlet_(.*)"
    {
       type            prghPressure;
       value           uniform 0;
        p   uniform 0;
    }


    "wall(.*)"
    {
    	//type            zeroGradient;
       // type            fixedValue;
        //value           uniform 90;
        type            fixedFluxPressure;
        //rho             rho;
        //value           unifrom $internalField;
    }
    
}


// ************************************************************************* //
