scripts/paper3/openfoam/pureBlockMesh/0.Orig/C_H2O.electrolyte
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C_H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 55195.86068831136; //30 wt% KOH

boundaryField
{

    "inlet_(.*)"
    {
    	type		fixedValue;
    	value		uniform 55195.86068831136;
    }

    "outlet_(.*)"
    {
        type            inletOutlet;
        value		    $internalField;
        inletValue      $internalField;
    }

    "wall(.*)"
    {
	type 		zeroGradient;
        //	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
