scripts/paper3/openfoam/pureBlockMesh/0.Orig/UNe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      UNe;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform -1.35;



boundaryField
{


    wallCathode
    {
    type            zeroGradient;
}
    "inlet_(.*)"
    {
    	type		zeroGradient;
    }

    "outlet_(.*)"
    {
        type            zeroGradient;
    }

    walls
    {
	type 		zeroGradient;
    }
        wallAnode
    {
	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
