scripts/paper3/openfoam/pureBlockMesh/0.Orig/Udm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);


boundaryField
{

    "inlet_(.*)"
    {
    	type	zeroGradient;

    }

    "outlet_(.*)"
    {
        type            zeroGradient;
    }

    "wall(.*)"
    {
            type            noSlip;
    	//type	zeroGradient;
        //type            fixedValue;
        //value		$internalField;
        //type	flowRateInletVelocity;
        //volumetricFlowRate constant 1e-4;
    }
    
}


// ************************************************************************* //
