scripts/paper3/openfoam/pureBlockMesh/system/meshSharedDict
// =========================
// global geometry + mesh controls
// =========================

#include "$FOAM_CASE/system/meshZgrading.auto";

// keep one master scale here
bmScale 1e-3;

// angles
a0  degToRad(12);   // local opening width
a1  degToRad(12);  // first branch center angle
a2  degToRad(15);  // offset between branch centres
a3  degToRad(45);
a4  degToRad(50);

// helper angles for point locations
th0 #eval{$a1 - $a0/2};
th1 #eval{$a1 + $a0/2};
th2 #eval{$a1 - $a0/2 + $a2};
th3 #eval{$a1 + $a0/2 + $a2};

// radii
R1 50;
R2 40;
R2i #eval{$R2*0.97};
yout #eval{$R1 + 10};

// thicknesses
tCh  3;
tEl  1.8;
tDi  0.85;

// z-grading controls
rMid23 2;
rMid01 2;

// representative inlet/outlet width (arc length on R1)
wInOut #eval{$R1*$a0};

// cylinder radius around each corner centre, in meters
cornerRefR  #eval{$wInOut*$bmScale};
cornerRefR2 #eval{0.25*$wInOut*$bmScale};

// z planes (in blockMesh units, before bmScale)
z0 #eval{-($tEl + $tCh + $tDi/2)};
z1 #eval{-($tEl + $tDi/2)};
z2 #eval{-($tDi/2)};
z3 #eval{ ($tDi/2)};
z4 #eval{ ($tEl + $tDi/2)};
z5 #eval{ ($tEl + $tCh + $tDi/2)};

// outer points
x0 #eval{sin($th0)*$R1};
y0 #eval{cos($th0)*$R1};

x1 #eval{sin($th1)*$R1};
y1 #eval{cos($th1)*$R1};

x2 #eval{sin($th2)*$R1};
y2 #eval{cos($th2)*$R1};

x3 #eval{sin($th3)*$R1};
y3 #eval{cos($th3)*$R1};

x4 #eval{sin($a4)*$R1};
y4 #eval{cos($a4)*$R1};

// inner points
x5 #eval{sin($th0)*$R2i};
y5 #eval{cos($th0)*$R2i};

x6 #eval{sin($th1)*$R2i};
y6 #eval{cos($th1)*$R2i};

x7 #eval{sin($th2)*$R2i};
y7 #eval{cos($th2)*$R2i};

x8 #eval{sin($th3)*$R2i};
y8 #eval{cos($th3)*$R2i};

x9 #eval{sin($a3)*$R2};
y9 #eval{cos($a3)*$R2};

// outlet points on y = +yout
x10 #eval{sin($th0)*$yout/cos($th0)};
x11 #eval{sin($th1)*$yout/cos($th1)};
x12 #eval{sin($th2)*$yout/cos($th2)};
x13 #eval{sin($th3)*$yout/cos($th3)};

// =========================
// metric versions for topoSet/refineMesh
// these match the generated mesh
// =========================

mx0 #eval{$x0*$bmScale};
my0 #eval{$y0*$bmScale};

mx1 #eval{$x1*$bmScale};
my1 #eval{$y1*$bmScale};

mx2 #eval{$x2*$bmScale};
my2 #eval{$y2*$bmScale};

mx3 #eval{$x3*$bmScale};
my3 #eval{$y3*$bmScale};

mz0 #eval{$z0*$bmScale};
mz5 #eval{$z5*$bmScale};

// mirrored inlet-side corner centres (same x, negative y)
min0x $mx0;
min0y #eval{-$my0};

min1x $mx1;
min1y #eval{-$my1};

min2x $mx2;
min2y #eval{-$my2};

min3x $mx3;
min3y #eval{-$my3};

// =========================
// refinement-cylinder controls
// =========================

cornerRefZ0 #eval{$mz0 - 0.1*$bmScale};
cornerRefZ1 #eval{$mz5 + 0.1*$bmScale};

// outlet corner cylinders around points 0,1,2,3
outCyl0_p1 ($mx0 $my0 $cornerRefZ0);
outCyl0_p2 ($mx0 $my0 $cornerRefZ1);

outCyl1_p1 ($mx1 $my1 $cornerRefZ0);
outCyl1_p2 ($mx1 $my1 $cornerRefZ1);

outCyl2_p1 ($mx2 $my2 $cornerRefZ0);
outCyl2_p2 ($mx2 $my2 $cornerRefZ1);

outCyl3_p1 ($mx3 $my3 $cornerRefZ0);
outCyl3_p2 ($mx3 $my3 $cornerRefZ1);

// mirrored in x
outCyl0_pm1 (#eval{-$mx0} $my0 $cornerRefZ0);
outCyl0_pm2 (#eval{-$mx0} $my0 $cornerRefZ1);

outCyl1_pm1 (#eval{-$mx1} $my1 $cornerRefZ0);
outCyl1_pm2 (#eval{-$mx1} $my1 $cornerRefZ1);

outCyl2_pm1 (#eval{-$mx2} $my2 $cornerRefZ0);
outCyl2_pm2 (#eval{-$mx2} $my2 $cornerRefZ1);

outCyl3_pm1 (#eval{-$mx3} $my3 $cornerRefZ0);
outCyl3_pm2 (#eval{-$mx3} $my3 $cornerRefZ1);

// inlet corner cylinders: mirrored in y
inCyl0_p1 ($min0x $min0y $cornerRefZ0);
inCyl0_p2 ($min0x $min0y $cornerRefZ1);

inCyl1_p1 ($min1x $min1y $cornerRefZ0);
inCyl1_p2 ($min1x $min1y $cornerRefZ1);

inCyl2_p1 ($min2x $min2y $cornerRefZ0);
inCyl2_p2 ($min2x $min2y $cornerRefZ1);

inCyl3_p1 ($min3x $min3y $cornerRefZ0);
inCyl3_p2 ($min3x $min3y $cornerRefZ1);

// mirrored in x as well
inCyl0_pm1 (#eval{-$min0x} $min0y $cornerRefZ0);
inCyl0_pm2 (#eval{-$min0x} $min0y $cornerRefZ1);

inCyl1_pm1 (#eval{-$min1x} $min1y $cornerRefZ0);
inCyl1_pm2 (#eval{-$min1x} $min1y $cornerRefZ1);

inCyl2_pm1 (#eval{-$min2x} $min2y $cornerRefZ0);
inCyl2_pm2 (#eval{-$min2x} $min2y $cornerRefZ1);

inCyl3_pm1 (#eval{-$min3x} $min3y $cornerRefZ0);
inCyl3_pm2 (#eval{-$min3x} $min3y $cornerRefZ1);

// =========================
// existing mesh controls
// =========================

res 1;
scale1 0.5;
scale_a 1;

scale_ch 20;
scale_el 14;
scale_di 8;

// defining lengths

// outer angular lengths on R1
L_a140 #eval{2*$R1*$th0};          // mirrored 14 -> 0
L_a01  #eval{$R1*($th1-$th0)};     // = R1*a0
L_a12  #eval{$R1*($th2-$th1)};     // = R1*(a2-a0)
L_a23  #eval{$R1*($th3-$th2)};     // = R1*a0
L_a34  #eval{$R1*($a4-$th3)};      // 3 -> 4

// right/left connector length
L_a432 #eval{2*$y4*$scale1};       // 4 -> 32, straight connector

// radial length
L_r #eval{$R1-$R2};

// mean inlet/outlet radial lengths
L_io1 #eval{0.5*(($yout/cos($th0)-$R1) + ($yout/cos($th1)-$R1))};
L_io2 #eval{0.5*(($yout/cos($th2)-$R1) + ($yout/cos($th3)-$R1))};

// axial lengths
L_z01 #eval{$z1-$z0};
L_z12 #eval{$z2-$z1};
L_z23 #eval{$z3-$z2};
L_z34 #eval{$z4-$z3};
L_z45 #eval{$z5-$z4};

// cell counts
n_a140 #eval{max(1, ceil($res*$L_a140*$scale_a))};
n_a01  #eval{max(1, ceil($res*$L_a01*$scale_a))};
n_a12  #eval{max(1, ceil($res*$L_a12*$scale_a))};
n_a23  #eval{max(1, ceil($res*$L_a23*$scale_a))};
n_a34  #eval{max(1, ceil($res*$L_a34*$scale_a))};
n_a432 #eval{max(1, ceil($res*$L_a432*$scale_a))};

n_r    #eval{max(1, ceil($res*$L_r))};

n_io1  #eval{max(1, ceil($res*$L_io1))};
n_io2  #eval{max(1, ceil($res*$L_io2))};

// z counts come from meshZgrading.auto
// n_z01 ...
// n_z12 ...
// n_z23 ...
// n_z34 ...
// n_z45 ...
