scripts/paper3/openfoam/pureBlockMesh/system/meshZgrading.auto
// auto-generated by make_zgrading.py
// all lengths and widths below are in mm

tEl 1.8;
tCh 3;
tDi 0.85;
// input lengths
L_z01 1.8;
L_z12 3;
L_z23 0.85;
L_z34 3;
L_z45 1.8;

// input first-cell widths for half-block calculations
widthEl 0.063;
widthCh 0.063;
widthDi 0.063;
cratioZ 1.2;

// solved cell counts
n_z01 20;
n_z12 14;
n_z23 10;
n_z34 14;
n_z45 20;

// solved grading ratios for each half-block
rEl 2.985984;
rCh 5.159780352;
rDi 2.0736;

// reconstructed half lengths for checking
Lhalf01_check 0.813701952;
Lhalf12_check 1.63539697306;
Lhalf23_check 0.4688208;

gradZ01
(
    (0.5 0.5 2.985984)
    (0.5 0.5 0.33489797668)
);

gradZ12
(
    (0.5 0.5 5.159780352)
    (0.5 0.5 0.193806699468)
);

gradZ23
(
    (0.5 0.5 2.0736)
    (0.5 0.5 0.48225308642)
);

gradZ34
(
    (0.5 0.5 5.159780352)
    (0.5 0.5 0.193806699468)
);

gradZ45
(
    (0.5 0.5 2.985984)
    (0.5 0.5 0.33489797668)
);
