scripts/paper3/openfoam/pureBlockMesh/system/refineMeshDict_IO
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


#include "$FOAM_CASE/system/meshSharedDict";
set wallNearCells_IO;

coordinateSystem patchLocal;

patchLocalCoeffs
{
    patch Walls.inletOutlet;
    tan1 (1 0 0);
}

directions
(
    normal
);

useHexTopology  false;
geometricCut    true;
writeMesh       false;


// ************************************************************************* //
