scripts/paper3/openfoam/pureBlockMesh/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




defaultFieldValues
(
    //volScalarFieldValue sigma_s 1000
    volScalarFieldValue Ne 0
    volScalarFieldValue Pe 0
    volScalarFieldValue Mem 0
    volScalarFieldValue eps 0.95
    volScalarFieldValue	tau 1.2
    volScalarFieldValue PeC 0
    volScalarFieldValue NeC 0
);
//anode cathode diaphrame cathodeChannel anodeChannel
regions
(
    zoneToCell
    {
    	zone     anodeChannel;
    	
    	fieldValues
    	(
    		volScalarFieldValue PeC 1
    		volScalarFieldValue eps 0.999
    		volScalarFieldValue tau 1
    	);
    }
    zoneToCell
    {
    	zone     cathodeChannel;
    	
    	fieldValues
    	(
    		volScalarFieldValue NeC 1
    		volScalarFieldValue eps 0.999
    		volScalarFieldValue tau 1
    	);
    }
    
        zoneToCell
    {
    	zone     diaphrame;
    	
    	fieldValues
    	(
    		volScalarFieldValue tau 2.7
    		volScalarFieldValue Mem 1
    		volScalarFieldValue eps 0.5
    	);
    }
            zoneToCell
    {
    	zone     cathode;
    	
    	fieldValues
    	(
    		volScalarFieldValue Ne 1
    	);
    }
            zoneToCell
    {
    	zone     anode;
    	
    	fieldValues
    	(
    		volScalarFieldValue Pe 1
    	);
    }

);


// ************************************************************************* //
