scripts/paper3/openfoam/pureBlockMesh/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      set1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
{
    type            surfaces;
        libs            (sampling);
        enabled         true;
	    writeControl    runTime;
	    writeInterval   0.1;

        interpolationScheme cellPoint;
        surfaceFormat       vtk;

        fields          (alpha.gas U UNe UPe Nec Pec Mem Ne Pe NeC PeC J Ie C_OH.electrolyte C_H2O.electrolyte C_H2.electrolyte C_O2.electrolyte);

        surfaces
        {
        
        plane0
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1e-5);
            normal  (0 0 1);
        }
                plane1
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1.32501e-3);
            normal  (0 0 1);
        }
        plane2
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 2.22501e-3);
            normal  (0 0 1);
        }
        plane3
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 3.72501e-3);
            normal  (0 0 1);
        }
        plane01
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 -1.32501e-3);
            normal  (0 0 1);
        }
        plane02
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 -2.22501e-3);
            normal  (0 0 1);
        }
        plane03
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 -3.72501e-3);
            normal  (0 0 1);
        }
        planeY
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1e-5);
            normal  (0 1 0);
        }
        planeXY
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1e-5);
            normal  (1 1 0);
        }
        planeX0
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1e-5);
            normal  (1 0 0);
        }
        planeX1
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (20.01e-3 1e-5 1e-5);
            normal  (1 0 0);
        }
        
        planeX01
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (-20.033e-3 1e-5 1e-5);
            normal  (1 0 0);
        }
        planeX005
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (-10.033e-3 1e-5 1e-5);
            normal  (1 0 0);
        }
        planeXp05
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (10.033e-3 1e-5 1e-5);
            normal  (1 0 0);
        }
        planeX0025
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (-5.033e-3 1e-5 1e-5);
            normal  (1 0 0);
        }
        planeXp025
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (5.033e-3 1e-5 1e-5);
            normal  (1 0 0);
        }
        planemXY
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1e-5);
            normal  (-1 1 0);
        }
         planeXmY
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 -2e-5 1e-4);
            normal  (1 -1 0);
        }
        planemXmY
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1e-5);
            normal  (-1 -1 0);
        }
        planem02XmY
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1e-5);
            normal  (-0.2 -1 0);
        }
        plane02XmY
        {

            type    plane;
            source  cell;
            store   false;
            interpolate true;
            triangulate true;

            point   (1e-5 1e-5 1e-5);
            normal  (0.2 -1 0);
        }
            
        }	
}  

  
// ************************************************************************* //


