scripts/paper3/openfoam/pureBlockMesh/system/topoSetDict2
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/system/meshSharedDict";


actions
(
    {
        name    cornerRefineCells;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        p1      $outCyl0_p1;
        p2      $outCyl0_p2;
        radius  $cornerRefR2;
    }
    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $outCyl1_p1;
        p2      $outCyl1_p2;
        radius  $cornerRefR2;
    }
    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $outCyl2_p1;
        p2      $outCyl2_p2;
        radius  $cornerRefR2;
    }
    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $outCyl3_p1;
        p2      $outCyl3_p2;
        radius  $cornerRefR2;
    }

    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $outCyl0_pm1;
        p2      $outCyl0_pm2;
        radius  $cornerRefR2;
    }
    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $outCyl1_pm1;
        p2      $outCyl1_pm2;
        radius  $cornerRefR2;
    }
    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $outCyl2_pm1;
        p2      $outCyl2_pm2;
        radius  $cornerRefR2;
    }
    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $outCyl3_pm1;
        p2      $outCyl3_pm2;
        radius  $cornerRefR2;
    }

    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $inCyl0_p1;
        p2      $inCyl0_p2;
        radius  $cornerRefR2;
    }
    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $inCyl1_p1;
        p2      $inCyl1_p2;
        radius  $cornerRefR2;
    }
        {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $inCyl0_pm1;
        p2      $inCyl0_pm2;
        radius  $cornerRefR2;
    }
    {
        name    cornerRefineCells;
        type    cellSet;
        action  add;
        source  cylinderToCell;
        p1      $inCyl1_pm1;
        p2      $inCyl1_pm2;
        radius  $cornerRefR2;
    }
/*    
    // cells directly attached to patch "Walls"
{
    name    wallNearCells;
    type    cellSet;
    action  new;
    source  patchToCell;
    patch   Walls;
}

// +1 layer away from wall
{
    name    wallNearCells;
    type    cellSet;
    action  add;
    source  haloToCell;
    
     steps       3;
}


// keep only corner-cylinder cells that are on/near the wall
{
    name    cornerRefineCells;
    type    cellSet;
    action  new;
    source  cellToCell;
    set     wallNearCells;
}*/
/*{
    name    wallNearCells_IO;
    type    cellSet;
    action  new;
    source  patchToCell;
    patch   Walls.inletOutlet;
}

// +1 layer away from wall
{
    name    wallNearCells_IO;
    type    cellSet;
    action  add;
    source  haloToCell;
    
     steps       2;
}

{
    name    cornerRefineCells;
    type    cellSet;
    action  add;
    source  cellToCell;
    set     wallNearCells_IO;
}*/
/*
{
    // Mandatory (inherited) entries
    name        outerCylinder;
    type        cellSet;
    action      new;

    // Mandatory entries
    source      cylinderToCell;
    p1          (0 0 $z0);
    p2          (0 0 $z5);
    radius      1000;

    // Optional entries
    innerRadius $R1;
}
{
    name    cornerRefineCells;
    type    cellSet;
    action  subtract;
    source  cellToCell;
    set     outerCylinder;
}*/
);
// ************************************************************************* //
